xiaoapeng/fly/arch/mcxn947/MCXN947/cmsis_drivers/fsl_gpio_cmsis.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_gpio_cmsis.h"
#include "fsl_gpio.h"
#include "fsl_port.h"

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.gpio_cmsis"
#endif

#if (defined(RTE_GPIO_PORT0) && RTE_GPIO_PORT0 && defined(GPIO0)) || \
    (defined(RTE_GPIO_PORT1) && RTE_GPIO_PORT1 && defined(GPIO1)) || \
    (defined(RTE_GPIO_PORT2) && RTE_GPIO_PORT2 && defined(GPIO2)) || \
    (defined(RTE_GPIO_PORT3) && RTE_GPIO_PORT3 && defined(GPIO3)) || \
    (defined(RTE_GPIO_PORT4) && RTE_GPIO_PORT4 && defined(GPIO4)) || \
    (defined(RTE_GPIO_PORT5) && RTE_GPIO_PORT5 && defined(GPIO5)) || \
    (defined(RTE_GPIO_PORTA) && RTE_GPIO_PORTA && defined(GPIOA)) || \
    (defined(RTE_GPIO_PORTB) && RTE_GPIO_PORTB && defined(GPIOB)) || \
    (defined(RTE_GPIO_PORTC) && RTE_GPIO_PORTC && defined(GPIOC)) || \
    (defined(RTE_GPIO_PORTD) && RTE_GPIO_PORTD && defined(GPIOD)) || \
    (defined(RTE_GPIO_PORTE) && RTE_GPIO_PORTE && defined(GPIOE))

/*!
 * @brief Type define for the pin state variable
 *
 */
typedef uint32_t gpio_cmsis_pin_state_t;

/*!
 * @brief Configuration for CMSIS GPIO Inteface instance
 *
 */
typedef struct _gpio_cmsis_config
{
    GPIO_Type *gpio_base;
    PORT_Type *port_base;
} gpio_cmsis_config_t;

/*!
 * @brief Handle for CMSIS GPIO inteface instance
 *
 */
typedef struct _gpio_cmsis_handle
{
    gpio_cmsis_config_t const *config;
    ARM_GPIO_SignalEvent_t cb_event;
} gpio_cmsis_handle_t;

typedef void (*gpio_isr_t)(gpio_cmsis_handle_t *gpioHandle);

static gpio_isr_t s_gpioIsr;

void CMSIS_GPIO_EventIRQ(gpio_cmsis_handle_t *handle);
/*
 * CMSIS GPIO Version
 */
#define ARM_CMSIS_GPIO_DRV_VERSION ARM_DRIVER_VERSION_MAJOR_MINOR(1U, 0U) /* driver version */

/*
 * ARMCC does not support split the data section automatically, so the driver
 * needs to split the data to separate sections explicitly, to reduce codesize.
 */
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
#define ARMCC_SECTION(section_name) __attribute__((section(section_name)))
#endif /* defined(__CC_ARM) || defined(__ARMCC_VERSION) */

static int32_t CMSIS_GPIO_Setup(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    gpio_pin_config_t pinConfig = {
        kGPIO_DigitalInput,
        0,
    };

    if(handle->cb_event == NULL)
    {
        handle->cb_event= cb_event; /* cb_event is CMSIS driver callback. */
    }

    /* Set pin as GPIO input without pull-resistor and event trigger. */
    PORT_SetPinMux(handle->config->port_base, pin, kPORT_MuxAsGpio);
#if !(defined(FSL_FEATURE_PORT_HAS_NO_INTERRUPT) && FSL_FEATURE_PORT_HAS_NO_INTERRUPT)
    PORT_SetPinInterruptConfig(handle->config->port_base, pin, kPORT_InterruptOrDMADisabled);
#endif
    handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PE_MASK) | PORT_PCR_PE(0);

    GPIO_PinInit(handle->config->gpio_base, pin, &pinConfig);

    return ARM_DRIVER_OK;
}

static int32_t CMSIS_GPIO_SetDirection(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{

    if (direction == ARM_GPIO_INPUT)
    {
        handle->config->gpio_base->PDDR &= GPIO_FIT_REG(~(1UL << pin));
    }
    else
    {
        handle->config->gpio_base->PDDR |= GPIO_FIT_REG((1UL << pin));
    }

    return ARM_DRIVER_OK;
}
static int32_t CMSIS_GPIO_SetOutputMode(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
#if defined(definedSL_FEATURE_PORT_HAS_OPEN_DRAIN) && definedSL_FEATURE_PORT_HAS_OPEN_DRAIN
    handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_ODE_MASK) | PORT_PCR_ODE(mode);
    return ARM_DRIVER_OK;
#else
    return ARM_DRIVER_ERROR_UNSUPPORTED;
#endif
}
static int32_t CMSIS_GPIO_SetPullResistor(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    switch (resistor)
    {
        case ARM_GPIO_PULL_NONE:
            handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PE_MASK) | PORT_PCR_PE(0);
            break;
        case ARM_GPIO_PULL_UP:
            handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PE_MASK) | PORT_PCR_PE(1);
            handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PS_MASK) | PORT_PCR_PS(1);
            break;
        case ARM_GPIO_PULL_DOWN:
            handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PE_MASK) | PORT_PCR_PE(1);
            handle->config->port_base->PCR[pin] = (handle->config->port_base->PCR[pin] & ~PORT_PCR_PS_MASK) | PORT_PCR_PS(0);
            break;
        default:
            assert(false);
            break;
    }

    return ARM_DRIVER_OK;
}
static int32_t CMSIS_GPIO_SetEventTrigger(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
    s_gpioIsr = CMSIS_GPIO_EventIRQ;
#if (defined(FSL_FEATURE_PORT_HAS_NO_INTERRUPT) && FSL_FEATURE_PORT_HAS_NO_INTERRUPT) || \
    (!defined(FSL_FEATURE_SOC_PORT_COUNT))
    switch (trigger)
    {
        case ARM_GPIO_TRIGGER_NONE:
            GPIO_SetPinInterruptConfig(handle->config->gpio_base, pin, kGPIO_InterruptStatusFlagDisabled);
            break;
        case ARM_GPIO_TRIGGER_RISING_EDGE:
            GPIO_SetPinInterruptConfig(handle->config->gpio_base, pin, kGPIO_InterruptRisingEdge);
            break;
        case ARM_GPIO_TRIGGER_FALLING_EDGE:
            GPIO_SetPinInterruptConfig(handle->config->gpio_base, pin, kGPIO_InterruptFallingEdge);
            break;
        case ARM_GPIO_TRIGGER_EITHER_EDGE:
            GPIO_SetPinInterruptConfig(handle->config->gpio_base, pin, kGPIO_InterruptEitherEdge);
            break;
        default:
            assert(false);
            break;
    }
#else
    switch (trigger)
    {
        case ARM_GPIO_TRIGGER_NONE:
            PORT_SetPinInterruptConfig(handle->config->port_base, pin, kPORT_InterruptOrDMADisabled);
            break;
        case ARM_GPIO_TRIGGER_RISING_EDGE:
            PORT_SetPinInterruptConfig(handle->config->port_base, pin, kPORT_InterruptRisingEdge);
            break;
        case ARM_GPIO_TRIGGER_FALLING_EDGE:
            PORT_SetPinInterruptConfig(handle->config->port_base, pin, kPORT_InterruptFallingEdge);
            break;
        case ARM_GPIO_TRIGGER_EITHER_EDGE:
            PORT_SetPinInterruptConfig(handle->config->port_base, pin, kPORT_InterruptEitherEdge);
            break;
        default:
            assert(false);
            break;
    }
#endif

    return ARM_DRIVER_OK;
}

