xiaoapeng/fly/arch/mcxn947/MCXN947/cmsis_drivers/fsl_gpio_cmsis.c
static int32_t GPIO_PORT5_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port5_handle, pin, mode);
}

static int32_t GPIO_PORT5_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port5_handle, pin, resistor);
}

static int32_t GPIO_PORT5_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO5_IRQ
    EnableIRQ(RTE_GPIO5_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port5_handle, pin, trigger);
}

static uint32_t GPIO_PORT5_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port5_handle, pin);
}

static void GPIO_PORT5_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port5_handle, pin, val);
}

#ifdef RTE_GPIO5_IRQ_HANDLER
void RTE_GPIO5_IRQ_HANDLER(void);
void RTE_GPIO5_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port5_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT5 = {
    .Setup           = GPIO_PORT5_Setup,
    .SetDirection    = GPIO_PORT5_SetDirection,
    .SetOutputMode   = GPIO_PORT5_SetOutputMode,
    .SetPullResistor = GPIO_PORT5_SetPullResistor,
    .SetEventTrigger = GPIO_PORT5_SetEventTrigger,
    .SetOutput       = GPIO_PORT5_SetOutput,
    .GetInput        = GPIO_PORT5_GetInput,
};
#endif

#if defined(GPIOA) && defined(RTE_GPIO_PORTA) && RTE_GPIO_PORTA

const gpio_cmsis_config_t s_gpio_portA_cmsis_config = {
    .gpio_base = GPIOA,
    .port_base = PORTA,
};

static gpio_cmsis_handle_t s_gpio_portA_handle = {
    .config         = &s_gpio_portA_cmsis_config,
};

static int32_t GPIO_PORTA_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_portA_handle, pin, cb_event);
}

static int32_t GPIO_PORTA_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_portA_handle, pin, direction);
}

static int32_t GPIO_PORTA_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_portA_handle, pin, mode);
}

static int32_t GPIO_PORTA_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_portA_handle, pin, resistor);
}

static int32_t GPIO_PORTA_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIOA_IRQ
    EnableIRQ(RTE_GPIOA_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_portA_handle, pin, trigger);
}

static uint32_t GPIO_PORTA_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_portA_handle, pin);
}

static void GPIO_PORTA_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_portA_handle, pin, val);
}

#ifdef RTE_GPIOA_IRQ_HANDLER
void RTE_GPIOA_IRQ_HANDLER(void);
void RTE_GPIOA_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_portA_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORTA = {
    .Setup           = GPIO_PORTA_Setup,
    .SetDirection    = GPIO_PORTA_SetDirection,
    .SetOutputMode   = GPIO_PORTA_SetOutputMode,
    .SetPullResistor = GPIO_PORTA_SetPullResistor,
    .SetEventTrigger = GPIO_PORTA_SetEventTrigger,
    .SetOutput       = GPIO_PORTA_SetOutput,
    .GetInput        = GPIO_PORTA_GetInput,
};
#endif

#if defined(GPIOB) && defined(RTE_GPIO_PORTB) && RTE_GPIO_PORTB

const gpio_cmsis_config_t s_gpio_portB_cmsis_config = {
    .gpio_base = GPIOB,
    .port_base = PORTB,
};

static gpio_cmsis_handle_t s_gpio_portB_handle = {
    .config = &s_gpio_portB_cmsis_config,
};

static int32_t GPIO_PORTB_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_portB_handle, pin, cb_event);
}

static int32_t GPIO_PORTB_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_portB_handle, pin, direction);
}

static int32_t GPIO_PORTB_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_portB_handle, pin, mode);
}

static int32_t GPIO_PORTB_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_portB_handle, pin, resistor);
}

static int32_t GPIO_PORTB_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIOB_IRQ
    EnableIRQ(RTE_GPIOB_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_portB_handle, pin, trigger);
}

static uint32_t GPIO_PORTB_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_portB_handle, pin);
}

static void GPIO_PORTB_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_portB_handle, pin, val);
}

#ifdef RTE_GPIOB_IRQ_HANDLER
void RTE_GPIOB_IRQ_HANDLER(void);
void RTE_GPIOB_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_portB_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORTB = {
    .Setup           = GPIO_PORTB_Setup,
    .SetDirection    = GPIO_PORTB_SetDirection,
    .SetOutputMode   = GPIO_PORTB_SetOutputMode,
    .SetPullResistor = GPIO_PORTB_SetPullResistor,
    .SetEventTrigger = GPIO_PORTB_SetEventTrigger,
    .SetOutput       = GPIO_PORTB_SetOutput,
    .GetInput        = GPIO_PORTB_GetInput,
};
#endif

#if defined(GPIOC) && defined(RTE_GPIO_PORTC) && RTE_GPIO_PORTC

const gpio_cmsis_config_t s_gpio_portC_cmsis_config = {
    .gpio_base = GPIOC,
    .port_base = PORTC,
};

static gpio_cmsis_handle_t s_gpio_portC_handle = {
    .config = &s_gpio_portC_cmsis_config,
};

static int32_t GPIO_PORTC_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_portC_handle, pin, cb_event);
}

static int32_t GPIO_PORTC_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_portC_handle, pin, direction);
}

static int32_t GPIO_PORTC_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_portC_handle, pin, mode);
}

static int32_t GPIO_PORTC_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_portC_handle, pin, resistor);
}

static int32_t GPIO_PORTC_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIOC_IRQ
    EnableIRQ(RTE_GPIOC_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_portC_handle, pin, trigger);
}

static uint32_t GPIO_PORTC_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_portC_handle, pin);
}

static void GPIO_PORTC_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_portC_handle, pin, val);
}

#ifdef RTE_GPIOC_IRQ_HANDLER
void RTE_GPIOC_IRQ_HANDLER(void);
void RTE_GPIOC_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_portC_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

