xiaoapeng/fly/arch/mcxn947/MCXN947/cmsis_drivers/fsl_gpio_cmsis.c
ARM_DRIVER_GPIO Driver_GPIO_PORTC = {
    .Setup           = GPIO_PORTC_Setup,
    .SetDirection    = GPIO_PORTC_SetDirection,
    .SetOutputMode   = GPIO_PORTC_SetOutputMode,
    .SetPullResistor = GPIO_PORTC_SetPullResistor,
    .SetEventTrigger = GPIO_PORTC_SetEventTrigger,
    .SetOutput       = GPIO_PORTC_SetOutput,
    .GetInput        = GPIO_PORTC_GetInput,
};
#endif

#if defined(GPIOD) && defined(RTE_GPIO_PORTD) && RTE_GPIO_PORTD

const gpio_cmsis_config_t s_gpio_portD_cmsis_config = {
    .gpio_base = GPIOD,
    .port_base = PORTD,
};

static gpio_cmsis_handle_t s_gpio_portD_handle = {
    .config = &s_gpio_portD_cmsis_config,
};

static int32_t GPIO_PORTD_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_portD_handle, pin, cb_event);
}

static int32_t GPIO_PORTD_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_portD_handle, pin, direction);
}

static int32_t GPIO_PORTD_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_portD_handle, pin, mode);
}

static int32_t GPIO_PORTD_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_portD_handle, pin, resistor);
}

static int32_t GPIO_PORTD_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIOD_IRQ
    EnableIRQ(RTE_GPIOD_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_portD_handle, pin, trigger);
}

static uint32_t GPIO_PORTD_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_portD_handle, pin);
}

static void GPIO_PORTD_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_portD_handle, pin, val);
}

#ifdef RTE_GPIOD_IRQ_HANDLER
void RTE_GPIOD_IRQ_HANDLER(void);
void RTE_GPIOD_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_portD_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORTD = {
    .Setup           = GPIO_PORTD_Setup,
    .SetDirection    = GPIO_PORTD_SetDirection,
    .SetOutputMode   = GPIO_PORTD_SetOutputMode,
    .SetPullResistor = GPIO_PORTD_SetPullResistor,
    .SetEventTrigger = GPIO_PORTD_SetEventTrigger,
    .SetOutput       = GPIO_PORTD_SetOutput,
    .GetInput        = GPIO_PORTD_GetInput,
};
#endif

#if defined(GPIOE) && defined(RTE_GPIO_PORTE) && RTE_GPIO_PORTE

const gpio_cmsis_config_t s_gpio_portE_cmsis_config = {
    .gpio_base = GPIOE,
    .port_base = PORTE,
};

static gpio_cmsis_handle_t s_gpio_portE_handle = {
    .config = &s_gpio_portE_cmsis_config,
};

static int32_t GPIO_PORTE_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_portE_handle, pin, cb_event);
}

static int32_t GPIO_PORTE_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_portE_handle, pin, direction);
}

static int32_t GPIO_PORTE_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_portE_handle, pin, mode);
}

static int32_t GPIO_PORTE_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_portE_handle, pin, resistor);
}

static int32_t GPIO_PORTE_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIOE_IRQ
    EnableIRQ(RTE_GPIOE_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_portE_handle, pin, trigger);
}

static uint32_t GPIO_PORTE_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_portE_handle, pin);
}

static void GPIO_PORTE_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_portE_handle, pin, val);
}

#ifdef RTE_GPIOE_IRQ_HANDLER
void RTE_GPIOE_IRQ_HANDLER(void);
void RTE_GPIOE_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_portE_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORTE = {
    .Setup           = GPIO_PORTE_Setup,
    .SetDirection    = GPIO_PORTE_SetDirection,
    .SetOutputMode   = GPIO_PORTE_SetOutputMode,
    .SetPullResistor = GPIO_PORTE_SetPullResistor,
    .SetEventTrigger = GPIO_PORTE_SetEventTrigger,
    .SetOutput       = GPIO_PORTE_SetOutput,
    .GetInput        = GPIO_PORTE_GetInput,
};
#endif
